function separateNum(str) {
    let regExp = /(\s|^)\d*\b(\s|$)/g;

    return str.match(regExp);
}

console.log(separateNum("3 привет 12 ываыва34 98 3423ыавыа 4545545 dfgd345345dfg 4"));

function validateApi(str) {

    let regExp = /^(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/g;

    //^ - начало строки
    // 25[0-5] - цифры от 250 до 255
    // |2[0-4][0-9] или начиная с 2 перебирает по одной цифре от 0 до 4 и от 0 до 9
    // |[01]? или подставляет [01] 0 или 1 раз, затем [0-9] цифра от 0 до 9 и затем [0-9]? от 0 до 9 - 0 или 1 раз
    // $ конец строки
    // (25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?) - группа для одной позиции от 0 до 255
    // \. экранирование точки

    console.log(regExp.test(str))
}

validateApi("100.249.0.255");